# Aula 02

**obs:** Veja no slide as instruções para configurar o ambiente para executar este aquivo.

Aluno(a): Lucas de Souza Silva

## Carregando o conjunto de dados

In [1]:
import pandas as pd
import requests
from io import StringIO

# Criação do dataFrame dos alunos
# ID do arquivo no Google Drive
file_id = '15aOJIGAyLMSY1gecjiCgu2ko_riIcKQy'
file_id2 = '1Jgto7psHaMRTAVzcFt7D6SgJiHMB7uGT'

# URL modificada para forçar o download do arquivo
url = f"https://drive.google.com/uc?id={file_id}"
url2 = f"https://drive.google.com/uc?id={file_id2}"


# Tentando obter o arquivo com requests
try:
    response = requests.get(url)
    response.raise_for_status()  # Lança um erro para respostas não-sucedidas
    # Usando StringIO para converter o texto em um arquivo em memória e, então, lendo com o Pandas
    csv_raw = StringIO(response.text)
    estudantes = pd.read_csv(csv_raw)
    
    response2 = requests.get(url2)
    response2.raise_for_status()  
    csv_raw = StringIO(response2.text)
    escolas = pd.read_csv(csv_raw)
except requests.RequestException as e:
    print(f"Erro ao acessar o arquivo: {e}")

**obs.:** todas as vezes que o presente arquivo for aberto é necessário executar a célula acima.

Analisando os dataframes

1 - Escolas

In [3]:
escolas

    ID_Escola Nome_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual
0           0    Escola A     Publica           2917          1910635
1           1    Escola B     Publica           2949          1884411
2           2    Escola C  Particular           1761          1056600
3           3    Escola D     Publica           4635          3022020
4           4    Escola E  Particular           1468           917500
5           5    Escola F  Particular           2283          1319574
6           6    Escola G  Particular           1858          1081356
7           7    Escola H     Publica           4976          3124928
8           8    Escola I  Particular            427           248087
9           9    Escola J  Particular            962           585858
10         10    Escola K  Particular           1800          1049400
11         11    Escola L     Publica           3999          2547363
12         12    Escola M     Publica           4761          3094650
13         13    Escola N     Publica           2739          1763916
14         14    Escola O  Particular           1635          1043130

2 - Estudantes

In [4]:
estudantes

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica
0,0,Kevin Bradley,M,6,Escola A,66,79
1,1,Paul Smith,M,9,Escola A,94,61
2,2,John Rodriguez,M,9,Escola A,90,60
3,3,Oliver Scott,M,9,Escola A,67,58
4,4,William Ray,F,6,Escola A,97,84
...,...,...,...,...,...,...,...
39155,39155,John Brooks,M,7,Escola O,92,98
39156,39156,Stephanie Contreras,F,8,Escola O,79,95
39157,39157,Kristen Gonzalez,F,6,Escola O,79,94
39158,39158,Kari Holloway,F,7,Escola O,87,90
39159,39159,Kimberly Cabrera,F,8,Escola O,85,72

Perguntas:

Existem dados faltantes nas tabelas? 

R: Não.

Existe algo em comum nas duas tabelas? 

R: Sim, a coluna Nome_escola.

### Combinando os datasets

In [6]:
estudantes.isnull().sum()

ID_Estudante       0
Nome_Estudante     0
Genero             0
Serie              0
Nome_Escola        0
Nota_Redacao       0
Nota_Matematica    0
dtype: int64

In [6]:
escolas.isna().sum()

ID_Escola          0
Nome_Escola        0
Tipo_Escola        0
Numero_Alunos      0
Orcamento_Anual    0
dtype: int64

In [8]:
data = pd.merge(estudantes, escolas, how='left', on=['Nome_Escola', 'Nome_Escola'])

In [9]:
data

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
0,0,Kevin Bradley,M,6,Escola A,66,79,0,Publica,2917,1910635
1,1,Paul Smith,M,9,Escola A,94,61,0,Publica,2917,1910635
2,2,John Rodriguez,M,9,Escola A,90,60,0,Publica,2917,1910635
3,3,Oliver Scott,M,9,Escola A,67,58,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39155,39155,John Brooks,M,7,Escola O,92,98,14,Particular,1635,1043130
39156,39156,Stephanie Contreras,F,8,Escola O,79,95,14,Particular,1635,1043130
39157,39157,Kristen Gonzalez,F,6,Escola O,79,94,14,Particular,1635,1043130
39158,39158,Kari Holloway,F,7,Escola O,87,90,14,Particular,1635,1043130
39159,39159,Kimberly Cabrera,F,8,Escola O,85,72,14,Particular,1635,1043130

As colunas Genero, Serie e Tipo Escola representam dados categóricos. Como podemos verificar a quantidade de valores distintos que existem em cada categoria?

In [10]:
data['Genero'].unique()

array(['M', 'F'], dtype=object)

In [11]:
data['Serie'].unique()

array([6, 9, 8, 7])

In [12]:
data['Tipo_Escola'].unique()

array(['Publica', 'Particular'], dtype=object)

### Algumas perguntas:

Qual o orçamento total das escolas?

In [40]:
escolas['Orcamento_Anual'].sum()

np.int64(24649428)

Qual a nota média dos alunos nas disciplinas analisadas?

In [41]:
mediaRedacao = data['Nota_Redacao'].mean()

In [42]:
mediaRedacao

np.float64(81.87574055158325)

In [43]:
mediaMatematica = data['Nota_Matematica'].mean()

In [44]:
mediaRedacao

np.float64(81.87574055158325)

Organizando os resultados

In [45]:
resultados = pd.DataFrame({
    "Operação": ["Média Redação", "Média Matemática"],
    "Resultado": [mediaRedacao, mediaMatematica]
})

display(resultados)

           Operação  Resultado
0     Média Redação  81.875741
1  Média Matemática  78.984934

Quantos alunos ficaram com nota superior a 90 em redação?

In [46]:
highRed = data[data["Nota_Redacao"] > 90]
len(highRed)

9973

E qual o percentual?

In [47]:
len(highRed)/len(estudantes) * 100

25.467313585291112

Quantos alunos ficaram com nota superior a 90 em matemática?

In [48]:
highMat = data[data["Nota_Matematica"] > 90]
len(highMat)

8834

Qual o percentual?

In [49]:
len(highMat)/len(estudantes) * 100

22.558733401430032

Quantos Alunos tiraram nota maior do que 90 nas duas disciplinas?

In [50]:
highBoth = data[(data["Nota_Matematica"] > 90) & (data["Nota_Redacao"] > 90)]
len(highBoth)

2323

Qual o percentual?

In [51]:
len(data[(data["Nota_Matematica"] > 90) & (data["Nota_Redacao"] > 90)])/len(estudantes) * 100

5.932073544433095

Quantos alunos que obtiveram alto desempenho em ambas as disciplinas são de escolas públicas?

In [52]:
highBoth["Tipo_Escola"].value_counts()

Tipo_Escola
Publica       1321
Particular    1002
Name: count, dtype: int64

Quantas alunas obtiveram alto desempenho em ambas as disciplinas?

In [53]:
highBoth["Genero"].value_counts()

Genero
M    1167
F    1156
Name: count, dtype: int64

Como ficou a distribuição dos alunos de alto desempenho pelas série?

In [54]:
highBoth["Serie"].value_counts()

Serie
6    663
8    604
7    599
9    457
Name: count, dtype: int64

Qual o total por escolas?

In [55]:
highBoth["Nome_Escola"].value_counts()

Nome_Escola
Escola D    252
Escola H    252
Escola M    239
Escola L    183
Escola F    172
Escola G    155
Escola K    153
Escola A    143
Escola B    142
Escola O    129
Escola C    129
Escola E    126
Escola N    110
Escola J     96
Escola I     42
Name: count, dtype: int64

In [56]:
sumario = highBoth.groupby(['Nome_Escola', 'Tipo_Escola']).size().sort_values(ascending=False)

print(sumario)

Nome_Escola  Tipo_Escola
Escola D     Publica        252
Escola H     Publica        252
Escola M     Publica        239
Escola L     Publica        183
Escola F     Particular     172
Escola G     Particular     155
Escola K     Particular     153
Escola A     Publica        143
Escola B     Publica        142
Escola O     Particular     129
Escola C     Particular     129
Escola E     Particular     126
Escola N     Publica        110
Escola J     Particular      96
Escola I     Particular      42
dtype: int64

Qual o orçamento per capita de cada escola?

In [57]:
perCapita = escolas['Orcamento_Anual'] / escolas['Numero_Alunos']
escolas['Per_Capita'] = perCapita

In [58]:
escolas_per_capita = pd.DataFrame({
    "Escola": escolas['Nome_Escola'],
    "Per_Capita": escolas['Per_Capita']
})
display(escolas_per_capita)

      Escola  Per_Capita
0   Escola A       655.0
1   Escola B       639.0
2   Escola C       600.0
3   Escola D       652.0
4   Escola E       625.0
5   Escola F       578.0
6   Escola G       582.0
7   Escola H       628.0
8   Escola I       581.0
9   Escola J       609.0
10  Escola K       583.0
11  Escola L       637.0
12  Escola M       650.0
13  Escola N       644.0
14  Escola O       638.0

Quais foram as escolas mais eficientes? 

Para tentar responder essa pergunta vamos adicionar o percentual de alunos de alto desempenho ao nosso dataset.

In [62]:
# Calculando o percentual de alunos de alto desempenho por escola
percentual_alto_desempenho = highBoth.groupby('Nome_Escola').size() / escolas.set_index('Nome_Escola')['Numero_Alunos'] * 100

In [63]:
# Adicionando ao dataframe de escolas
escolas['Percentual_Alto_Desempenho'] = escolas['Nome_Escola'].map(percentual_alto_desempenho)

In [64]:
# Exibindo as escolas ordenadas pelo percentual de alto desempenho
escolas_eficientes = escolas.sort_values(by='Percentual_Alto_Desempenho', ascending=False)
display(escolas_eficientes[['Nome_Escola', 'Percentual_Alto_Desempenho', 'Per_Capita']])

   Nome_Escola  Percentual_Alto_Desempenho  Per_Capita
9     Escola J                    9.979210       609.0
8     Escola I                    9.836066       581.0
4     Escola E                    8.583106       625.0
10    Escola K                    8.500000       583.0
6     Escola G                    8.342304       582.0
14    Escola O                    7.889908       638.0
5     Escola F                    7.533947       578.0
2     Escola C                    7.325383       600.0
3     Escola D                    5.436893       652.0
7     Escola H                    5.064309       628.0
12    Escola M                    5.019954       650.0
0     Escola A                    4.902297       655.0
1     Escola B                    4.815192       639.0
11    Escola L                    4.576144       637.0
13    Escola N                    4.016064       644.0